app/controllers/trackings_controller.rb

SELECT `trackings`.* FROM `trackings` WHERE (page_url LIKE 3)
---
  def index
    @trackings = Tracking.all

INSERT INTO `trackings` (`page_url`, `video_url`, `created_at`, `updated_at`) VALUES ('www.google.com', 'test video url', '2017-05-23 17:48:35', '2017-05-23 17:48:35')
---
  def create
    @tracking = Tracking.new(tracking_params)

    respond_to do |format|
      if @tracking.save

SELECT `trackings`.* FROM `trackings` WHERE (page_url LIKE NULL)
---
  def update_trackings
    @trackings = Tracking.where("page_url LIKE ?", params[:page_url])

SELECT  `trackings`.* FROM `trackings` WHERE `trackings`.`id` = 1 LIMIT 1
---
    def set_tracking
      @tracking = Tracking.find(params[:id])